## Compulsory Task 

In this compulsory task you will clean the country column and parse the date column in the **store_income_data_task.csv** file.

In [2]:
# Importing libraries.
import pandas as pd
import numpy as np
import fuzzywuzzy
from fuzzywuzzy import process
import chardet
from datetime import datetime

In [3]:
# Loading up 'store_income_data.csv'.
df_store_income = pd.read_csv(
    'store_income_data_task.csv', 
    index_col=0,
    header=0
)
df_store_income.head()

,store_name,store_email,department,income,date_measured,country
id,,,,,,
1,"Cullen/Frost Bankers, Inc.",NaN,Clothing,$54438554.24,4-2-2006,United States/
2,Nordson Corporation,NaN,Tools,$41744177.01,4-1-2006,Britain
3,"Stag Industrial, Inc.",NaN,Beauty,$36152340.34,12-9-2003,United States
4,FIRST REPUBLIC BANK,ecanadine3@fc2.com,Automotive,$8928350.04,8-5-2006,Britain/
5,Mercantile Bank Corporation,NaN,Baby,$33552742.32,21-1-1973,United Kingdom

1. Take a look at all the unique values in the "country" column. Then, convert the column to lowercase and remove any trailing white spaces.

In [3]:
# Unique values in the "country" column.
countries = df_store_income['country'].unique()
print(f"\nUnique values in the country column:{len(countries)}")
countries

Unique values in the country column:77

array(['United States/', 'Britain', ' United States', 'Britain/',
       ' United Kingdom', 'U.K.', 'SA ', 'U.K/', 'America',
       'United Kingdom', nan, 'united states', ' S.A.', 'England ', 'UK',
       'S.A./', 'ENGLAND', 'BRITAIN', 'U.K', 'U.K ', 'America/', 'SA.',
       'S.A. ', 'u.k', 'uk', ' ', 'UK.', 'England/', 'england',
       ' Britain', 'united states of america', 'UK/', 'SA/', 'SA',
       'England.', 'UNITED KINGDOM', 'America.', 'S.A..', 's.a.', ' U.K',
       ' United States of America', 'Britain ', 'England', ' SA',
       'United States of America.', 'United States of America/',
       'United States.', 's. africasouth africa', ' England',
       'United Kingdom ', 'United States of America ', ' UK',
       'united kingdom', 'AMERICA', 'America ',
       'UNITED STATES OF AMERICA', ' S. AfricaSouth Africa', 'america',
       'S. AFRICASOUTH AFRICA', 'Britain.', '/', 'United Kingdom.',
       'United States', ' America', 'UNITED STATES', 'sa',
       'United States of America', 'UK ', 'United States ',
       'S. AfricaSouth Africa/', 'S.A.', 'United Kingdom/',
       'S. AfricaSouth Africa ', 'S. AfricaSouth Africa.',
       'S. AfricaSouth Africa', '.', 'britain'], dtype=object)

In [4]:
# Converting to the lower case.
df_store_income['country'] = df_store_income['country'].str.lower()
# Removing tailing whitespaces. 
df_store_income['country'] = df_store_income['country'].str.strip()

# Unique values in the "country" column.
countries = df_store_income['country'].unique()
print(f"\nUnique values in the country column:{len(countries)}")
countries

Unique values in the country column:37

array(['united states/', 'britain', 'united states', 'britain/',
       'united kingdom', 'u.k.', 'sa', 'u.k/', 'america', nan, 's.a.',
       'england', 'uk', 's.a./', 'u.k', 'america/', 'sa.', '', 'uk.',
       'england/', 'united states of america', 'uk/', 'sa/', 'england.',
       'america.', 's.a..', 'united states of america.',
       'united states of america/', 'united states.',
       's. africasouth africa', 'britain.', '/', 'united kingdom.',
       's. africasouth africa/', 'united kingdom/',
       's. africasouth africa.', '.'], dtype=object)

2. Note that there should only be three separate countries. Eliminate all variations, so that 'South Africa', 'United Kingdom' and 'United States' are the only three countries.

In [5]:
# Getting the top 10 closest matches to "united kingdom".
matches = fuzzywuzzy.process.extract(
    "uk", 
    countries, 
    limit=20, 
    scorer=fuzzywuzzy.fuzz.token_sort_ratio
)

# Inspecting matches.
matches
df_store_income.head()

,store_name,store_email,department,income,date_measured,country
id,,,,,,
1,"Cullen/Frost Bankers, Inc.",NaN,Clothing,$54438554.24,4-2-2006,united states/
2,Nordson Corporation,NaN,Tools,$41744177.01,4-1-2006,britain
3,"Stag Industrial, Inc.",NaN,Beauty,$36152340.34,12-9-2003,united states
4,FIRST REPUBLIC BANK,ecanadine3@fc2.com,Automotive,$8928350.04,8-5-2006,britain/
5,Mercantile Bank Corporation,NaN,Baby,$33552742.32,21-1-1973,united kingdom

In [6]:
def replace_matches_in_column(df, column, string_to_match, min_ratio =65):
    """
    # Function to replace rows in the provided column of the provided 
    # DataFrame that match the provided string above the provided ratio
    # with the provided string.
    """
    # Getting a list of unique strings.
    strings = df[column].unique()
    # Getting the top 10 closest matches to our input string.
    matches = fuzzywuzzy.process.extract(
        string_to_match, 
        strings, limit=20, 
        scorer=fuzzywuzzy.fuzz.token_sort_ratio
    )

    # Only getting matches with a ratio > 65.
    close_matches = [
        matches[0] for matches in matches if matches[1] >= min_ratio
    ]
    # Getting the rows of all the close matches in our dataframe.
    rows_with_matches = df[column].isin(close_matches)
    # Replacing all rows with close matches with the input matches.
    df.loc[rows_with_matches, column] = string_to_match
    
    # Verifiyng when the function is done.
    print("All done!")

In [7]:
# Calling the function " replace_matches_in_column()".
# List of strings to match.
strings_to_match = [
    "united kingdom", 
    "united states", 
    "united states of america", 
    "south africa",
    "uk", 
    "britain", 
    "england", 
    "s.a", 
    "sa", 
    "u.k", 
    "america", 
    #"s. africasouth Africa"
]

# Iterating through the list and calling replace_matches_in_column 
# function.
for string in strings_to_match:
    replace_matches_in_column(
        df=df_store_income, 
        column='country', 
        string_to_match=string
    )

All done!
All done!
All done!
All done!
All done!
All done!
All done!
All done!
All done!
All done!
All done!

In [8]:
# After cleaning unique values in the "country" column.
countries = df_store_income['country'].unique()
print(f"\nUnique values in the country column:{len(countries)}")
countries

Unique values in the country column:14

array(['united states of america', 'britain', 'united kingdom', 'u.k',
       'sa', 'america', nan, 's.a', 'england', 'uk', '', 'south africa',
       '/', '.'], dtype=object)

In [9]:
# Replacing the country names with United Kingdom, United States and 
# South Africa.
replace_with_countries_name = {
    'united states' : 'United States',
    'america' : 'United States',
    'united states of america' : 'United States',
    'britain' : 'United Kingdom',
    'united kingdom' : 'United Kingdom',
    'u.k' : 'United Kingdom',
    'england' : 'United Kingdom',
    'uk' : 'United Kingdom',
    'sa' : 'South Africa',
    's.a' : 'South Africa',
    ''  : None,
    '/' : None,
    '.' : None,
    'south africa': 'South Africa'
}

df_store_income.replace(replace_with_countries_name, inplace=True)

In [10]:
# Replacing missing values by mode.
mode_of_country = df_store_income['country'].mode()[0]
df_store_income['country'] = df_store_income['country'].fillna(mode_of_country)
print(df_store_income['country'].unique())

['United States' 'United Kingdom' 'South Africa']

3. Create a new column called `days_ago` in the DataFrame that is a copy of the 'date_measured' column but instead it is a number that shows how many days ago it was measured from the current date. Note that the current date can be obtained using `datetime.date.today()`.

In [11]:
# Creating new called column days_ago and copying date_measured column.
df_store_income['days_ago'] = df_store_income['date_measured'].copy()
df_store_income.head()

,store_name,store_email,department,income,date_measured,country,days_ago
id,,,,,,,
1,"Cullen/Frost Bankers, Inc.",NaN,Clothing,$54438554.24,4-2-2006,United States,4-2-2006
2,Nordson Corporation,NaN,Tools,$41744177.01,4-1-2006,United Kingdom,4-1-2006
3,"Stag Industrial, Inc.",NaN,Beauty,$36152340.34,12-9-2003,United States,12-9-2003
4,FIRST REPUBLIC BANK,ecanadine3@fc2.com,Automotive,$8928350.04,8-5-2006,United Kingdom,8-5-2006
5,Mercantile Bank Corporation,NaN,Baby,$33552742.32,21-1-1973,United Kingdom,21-1-1973

In [12]:
# Checking the data type of the columns.
df_store_income.dtypes

store_name       object
store_email      object
department       object
income           object
date_measured    object
country          object
days_ago         object
dtype: object

In [13]:
# Converting date_measured column into datetime format.
df_store_income['date_measured'] =  pd.to_datetime(
    df_store_income['date_measured'], 
    format='%d-%m-%Y'
)
df_store_income.head()

,store_name,store_email,department,income,date_measured,country,days_ago
id,,,,,,,
1,"Cullen/Frost Bankers, Inc.",NaN,Clothing,$54438554.24,2006-02-04,United States,4-2-2006
2,Nordson Corporation,NaN,Tools,$41744177.01,2006-01-04,United Kingdom,4-1-2006
3,"Stag Industrial, Inc.",NaN,Beauty,$36152340.34,2003-09-12,United States,12-9-2003
4,FIRST REPUBLIC BANK,ecanadine3@fc2.com,Automotive,$8928350.04,2006-05-08,United Kingdom,8-5-2006
5,Mercantile Bank Corporation,NaN,Baby,$33552742.32,1973-01-21,United Kingdom,21-1-1973

In [14]:
# Checking data type.
df_store_income['date_measured'].dtype

dtype('<M8[ns]')

In [15]:
# Calculating number of days ago that it measured.
today = datetime.today() # Current day.

df_store_income['days_ago'] = (
    today - df_store_income['date_measured']
).dt.days
df_store_income.head()

,store_name,store_email,department,income,date_measured,country,days_ago
id,,,,,,,
1,"Cullen/Frost Bankers, Inc.",NaN,Clothing,$54438554.24,2006-02-04,United States,6610
2,Nordson Corporation,NaN,Tools,$41744177.01,2006-01-04,United Kingdom,6641
3,"Stag Industrial, Inc.",NaN,Beauty,$36152340.34,2003-09-12,United States,7486
4,FIRST REPUBLIC BANK,ecanadine3@fc2.com,Automotive,$8928350.04,2006-05-08,United Kingdom,6517
5,Mercantile Bank Corporation,NaN,Baby,$33552742.32,1973-01-21,United Kingdom,18677